examples/delta-wing-5p3o-local/input/case_template/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    minX // inlet
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }
    maxX // outlet
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }

    minY // right side
    {
        type            slip;
    }
    maxY // left side
    {
        type            slip;
    }
    minZ // bottom
    {
        type            movingWallVelocity;
        value           uniform (10 0 0);
    }
    maxZ // top
    {
        type            slip;
    }
    solid
    {
        type            noSlip;
    }

}


// ************************************************************************* //
