examples/delta-wing-5p3o-local/input/case_template/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "combined.fms";

maxCellSize 0.5;

localRefinement
{
    solid
    {
        additionalRefinementLevels 7;
        refinementThickness 0.1;
    }
}

boundaryLayers
{
    patchBoundaryLayers
    {
        solid
        {
            nLayers 10;
            thicknessRatio 1.2;
            maxFirstLayerThickness 0.002; //- defines the overall thickness
            allowDiscontinuity 0; 
        }
    }
    optimiseLayer 1;
    optimisationParameters
    {
        nSmoothNormals 15;            // More smoothing iterations
        nSmoothSurfaceNormals 10;
        nSmoothThickness 10;
        reCalculateNormals 1;
        maxNumIterations 10;
    }
}

objectRefinements
{
    refinement1
    {
        type cone;
        cellSize 0.25;
        centre (0.5 0 0);
        p0 (-2 0 0);
        p1 (8 0 0);
        radius0 3;
        radius1 3;
    }
    refinement2
    {
        type cone;
        cellSize 0.1;
        centre (0.5 0 0);
        p0 (-1 0 0);
        p1 (5 0 0);
        radius0 2;
        radius1 2;
    }
    refinement3
    {
        type box;
        cellSize 0.05;
        centre (1.75 0 0);
        lengthX 4.5;
        lengthY 3;
        lengthZ 1.55;
    }
    refinement4
    {
        type box;
        cellSize 0.01;
        centre (1.5 0 0);
        lengthX 3.5;
        lengthY 1.75;
        lengthZ 1;
    }
}

renameBoundary
{
    defaultType wall;
    
    newPatchNames
    {
        xMin
        {
            // newName inlet; - should be the actual name, need to modfy 0/ directory tho, too much work, just using previous conventions
            newName minX;
            type patch;
        }
        xMax
        {
            // newName outlet; - should be the actual name, need to modfy 0/ directory tho, too much work, just using previous conventions
            newName maxX;
            type patch;
        }
        yMin
        {
            // newName front; - should be the actual name, need to modfy 0/ directory tho, too much work, just using previous conventions
            newName minY;
            type patch;
        }
        yMax
        {
            // newName back; - should be the actual name, need to modfy 0/ directory tho, too much work, just using previous conventions
            newName maxY;
            type patch;
        }
        zMin
        {
            // newName bottom; - should be the actual name, need to modfy 0/ directory tho, too much work, just using previous conventions
            newName minZ;
            type wall;
        }
        zMax
        {
            // newName top; - should be the actual name, need to modfy 0/ directory tho, too much work, just using previous conventions
            newName maxZ;
            type patch;
        }
    }
}

// ************************************************************************* //
